// Методы типа number
// toString() // переводит в string
// toFixed() // округляет не целые числа затем переводит в string
// Math.floor(num0) // округление вниз
Math.ceil(num2) // округление вверх
Math.round(num3) // логической округление
Math.min()
Math.max()
Math.random()
Math.floor(Math.random() * (max - min + 1)) + min; // рандомные цифры с min, max
parseFloat(num4) // string => number
parseInt(num5) // string => number удаляет цифры после точки
isNaN(num6) // проверяет не является ли переменная типом number
+num7 // string => number


let arr = [10.45, 9.519, 85.56, 22, 6.26, 98.245, 15, 34.2]
let min
let max

// Достать наименьшее число с массива, округлить логически и сохранить в min  
// достать наибольшее число с массива, округлить вверх и сохранить в max
// поделить с остатком max на min, показать результат


let num1 = 10.4568313123132

// 1. num1 переводим в string, оставляем только три цифры после точки: '10.456'
// 2. показать длину полученной строки 
// 3. полученную строку переводим в тип number оставляя лишь целое число (убрать все цифры после точки)
// 4. проверяем не является ли переменная типом number


let minRandom = 10
let maxRandom = 50

// генерация рандомных чисел от 10 до 50



